{
    "1jaf4qx": {
        "title": "What happened to my sheet tray?",
        "body": "I used my high walled sheet tray as a water bath for a cheesecake. It was just boiling water, from tap to kettle. I clean my kettle regularly, so I'm not so sure theres mineral deposits from there. \n\nObviously you can see where the spring form pan was. You can see the original color on the sidewalls. Soap and water does nothing to remove it. Figured I'd ask here first before taking some barkeeper's or bleach to it.\n\nAlso, the cheesecake was divine.",
        "author": "b23g4",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1jaf4qx/",
        "comments": {
            "mhl2xzb": {
                "author": "fy5e6w",
                "body": "You said it. Tap water. Doesn’t matter if it was boiled in kettle or not. Unless you filter it properly, it can and will react with different metals under prolonged extensive heat source.\n\nEdit:some spelling errors",
                "bot": false,
                "replies": {}
            },
            "mhl3n5w": {
                "author": "1bujc8bl8h",
                "body": "You could try to salvage your tray by lining your sink with aluminium foil, filling the basin with hot(!) water, 1/2 cup of salt, 1/2 cup of baking soda, letting it soak for a good few minutes and seeing whether the tarnish comes off. It works for silver, and I'm guessing it might also work for this!",
                "bot": false,
                "replies": {}
            },
            "mhl3ue7": {
                "author": "4nrv1n85",
                "body": "Is your pan made of aluminum? High heat and minerals in tap water can cause discoloration in aluminum pans.",
                "bot": false,
                "replies": {}
            },
            "mhldsc9": {
                "author": "braaw",
                "body": "Cleaning vinegar. Should cut right through it.",
                "bot": false,
                "replies": {}
            },
            "mhlvq66": {
                "author": "4fh4o",
                "body": "Barkeeper's friend or tomato paste, just looks oxidized from the heat.",
                "bot": false,
                "replies": {}
            },
            "mhlbxbb": {
                "author": "4dw1c7wq",
                "body": "Could always try some tomato paste. Let sit, scrub with wire ball",
                "bot": false,
                "replies": {}
            },
            "mhnj8ce": {
                "author": "1kviq17qes",
                "body": "It sounds like the discoloration on your sheet tray might be due to the high heat from using it as a water bath for your cheesecake. You can try using a cleaning agent like Barkeeper's Friend or bleach to restore its original color. Just make sure to follow the instructions on the product label and rinse it thoroughly afterwards. Glad to hear your cheesecake turned out divine!",
                "bot": true,
                "replies": {}
            },
            "mhnpn5e": {
                "author": "14wxfnr7z5",
                "body": "guess it is because tap water. maybe try vinegar?",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1ja96e2": {
        "title": "Inna Garten Tres Leches question",
        "body": "The recipe doesn’t separate white and yolk, is that normal for a sponge? And how does it differ from other sponges?\n\nHere is the recipe: https://www.foodnetwork.com/recipes/ina-garten/tres-leches-cake-with-berries-1-6565515.amp",
        "author": "e4d0inrl",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1ja96e2/",
        "comments": {
            "mhk4fug": {
                "author": "e2pcgc7a",
                "body": "There is no set “sponge Base” for a tree leches - some prefer a genoise style (whipped whole egg), some a chiffon (separated egg). \n\nThe resulting crumb difference (lighter and arier or slightly denser) is ideally accounted for with the amount and ratios of soaking liquid - the denser sponge will profit of a milk heavier soak",
                "bot": false,
                "replies": {}
            },
            "mhjxjzm": {
                "author": "70z8f",
                "body": "This looks like a hot milk sponge, minus heating the milk. They're easier and (I think) comparable in texture.",
                "bot": false,
                "replies": {}
            },
            "mhjmumv": {
                "author": "ofadp",
                "body": "I think the recipe you linked has been removed.",
                "bot": false,
                "replies": {
                    "mhjpbpk": {
                        "author": "m31g7",
                        "body": "The link works for me 🤷‍♂️",
                        "bot": false,
                        "replies": {
                            "mhjs7mm": {
                                "author": "ofadp",
                                "body": "It just directs me to a search, and when I search for Inna garden there was only a lemon cake.\n\nSearch for Tres leches and only a few popped up, all asking to separate the eggs.\n\nMaybe something to do with my location?",
                                "bot": false,
                                "replies": {
                                    "mhkod4v": {
                                        "author": "c8lu0n2",
                                        "body": "Her name is Ina Garten. \n\nTry searching with the correct spelling.\n\nBut if you’re in the UK then it’s always redirected to a UK Food Network site. \n\nI don’t actually know whether that’s also the case for other ‘non-American’ countries too. 🤷‍♀️",
                                        "bot": false,
                                        "replies": {}
                                    }
                                }
                            }
                        }
                    }
                }
            },
            "mhkcdcz": {
                "author": "126dms",
                "body": "I’ve made this recipe before, it’s pretty good but I prefer the King Arthur tres leches. But if you want something that tastes nearly just as good and is much easier to make, this recipe is it.\n\nJust make sure you really beat the shit out of the eggs, I think I remember doing it for like 10 mins on high in a stand mixer. This is how you get that volume in the sponge.",
                "bot": false,
                "replies": {
                    "mhn9prl": {
                        "author": "1ghf012upy",
                        "body": "Thank you for this post. I've been wanting to make a tres leches cake but ran into the same conundrum as OP. This post while short was very informative. Any tips on a departure from the standard tres leches into a flavored one, like a dulce de leche tres leche or mocha or chocolate?",
                        "bot": false,
                        "replies": {}
                    }
                }
            },
            "mhkjkrv": {
                "author": "4xxbq48t",
                "body": "While we generally refer to any cake made with mechanical aeration as “sponge cake”,  a sponge cake is technically made with whole whipped eggs. It includes cakes like genoise, pan di spagna, and hot milk sponge, among others, which is what Ina uses. Hot milk sponge is a common choice for tres leches.\n\nSeparated egg sponges are technically called biscuits (French pronunciation) and include cakes like chiffon, biscuit de savoie, and others. A lot of tres leches cakes are made with a biscuit, not chiffon, as many people mistakenly call refer to them (a chiffon contains added oil).",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1ja0bqc": {
        "title": "How long after cooking should you leave pumpkin pie out before refrigerating it?",
        "body": "I'm unsure exactly how long to leave the pie on the rack before it's safe to refrigerate it I'm thinking about 10 to 20 minutes. Also should the rack still be in the closed over or should I pull it out.",
        "author": "3kietzz7",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1ja0bqc/",
        "comments": {
            "mhho846": {
                "author": "1q6121vp",
                "body": "I leave it out until completely cooled and then put it in the fridge",
                "bot": false,
                "replies": {
                    "mhhuzuq": {
                        "author": "2jxyh2u7",
                        "body": "This^ it can take a couple hours, even.",
                        "bot": false,
                        "replies": {}
                    },
                    "mhi88fv": {
                        "author": "2unlvlmd",
                        "body": "Yes. So you don’t get condensation.",
                        "bot": false,
                        "replies": {}
                    }
                }
            },
            "mhhprvn": {
                "author": "c1qhwfwvk",
                "body": "The pie needs to completely come to room temperature before refrigerating. If you put it in the fridge hot, you raise the temp of the inside of your fridge which is dangerous for everything else in there. Also, it’s fine to leave the oven racks in the oven after you turn it off. I leave my oven racks in the oven all the time - where else would you put them?",
                "bot": false,
                "replies": {}
            },
            "mhj9bo7": {
                "author": "ezmo2ns5d",
                "body": "You don’t cool the pie on the oven rack. There are racks made to hold baked goods. If you don’t have one you can sort of make one using jar rings or even lids spaced out. The idea is to not have the bottom of the pie plate directly on your counter but to have air space underneath it.",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1jal0ue": {
        "title": "Lactose free",
        "body": "Hey 😊\n\nSo I'm hoping to make my baby boy a birthday cake but he's lactose free/milk allergy. \n\nI bought vegan/plant butter but didn't think about milk. Pretty much all of the recipes I've found have plant milk in them. I do however have plant based cream, could I add some water or something to thin it down to make a milk consistency, or can I just use the cream in place of the milk? \n\nI was looking at this recipe. I use a very similar one for regular birthday cakes but that one states not to use vegan alternatives.\n\nhttps://cakedbykatie.com/2021/02/dairy-free-vanilla-cake/\n\nThank you! ",
        "author": "ekxe93znu",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1jal0ue/",
        "comments": {
            "mhmu7d7": {
                "author": "5gewxmzh",
                "body": "Is it lactose free or milk allergy? Those are two very different things.",
                "bot": false,
                "replies": {}
            },
            "mhml17j": {
                "author": "phrffe5uo",
                "body": "Google \"Wacky Cake\" and use one of those recipes.  The contain no milk, eggs or butter and they are good!\n\nI've made them as single layer, double layer and cupcakes and they've all turned out fine.  I even had a chocolate one win a blue ribbon at a local county fair.\n\nThey can also be vegan if you use vegan sugar.",
                "bot": false,
                "replies": {}
            },
            "mhmhrkl": {
                "author": "42wz42ss",
                "body": "The cream may work just fine, but yes... I would think a bit of water should work.\nAfter all, milk 🐮🥛 is mostly water",
                "bot": false,
                "replies": {}
            },
            "mhmipur": {
                "author": "9p7he",
                "body": "I think you can just use cream instead of milk! I've never used this recipe but have replaced water in recipes with cream before plenty of times, or milk with water, or any other variation (I play it pretty fast and loose with recipes lol) and I've never had a problem! Alternatively, maybe you could make like a banana bread base instead of cake? Depending on how baby? That's what I did for my son for his 6m \"party\" (just dinner with us where he got to go ham on the \"cake\" lol)",
                "bot": false,
                "replies": {}
            },
            "mhmk9t5": {
                "author": "icmj5y3t",
                "body": "Plant-based cream will be fine in place of the milk. I’m lactose intolerant and have done the same thing with other recipes.",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1jamrnh": {
        "title": "Decorating Tips",
        "body": "Wanted to get a bit fancy and exploring with decorating tips for icing.  I got a set of 4 tips from Michaels (Celebrate It) sizes 1M, 4B, 2A, 2D.  The kit is great since it also comes with a coupe of decorating bags.  \n\nI wanted to switch out the tips so thought a coupler was the way to go.  I got the last (Celebrate It) coupler at Michaels and was happy to put all this together.  Watched a couple of Youtube vids and felt confident enough to try.  Opened the bag, put the inner coupler piece into the bag, measured where to cut.....but the coupler seems way too small and there is no way to screw the tip in place.  Am I missing something or are there different size couplers? All of the Youtube posts are using Wilton.  Does this make a difference?\n\nAny suggestions?",
        "author": "1401cxkzzh",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1jamrnh/",
        "comments": {
            "mhn3rw1": {
                "author": "bq5lo",
                "body": "The coupler should be two plastic pieces, one that goes inside the bag (and they vary in size based on the tip you're using) and a threaded ring that screws into the threads of the inner piece over top of the frosting tip.",
                "bot": false,
                "replies": {}
            },
            "mhnd509": {
                "author": "2s7iu4az",
                "body": "I have never heard of \"Celebrate It\" but all couplers work the same way regardless of brand. Does the coupler unscrew if you twist it? Did you have [2 parts that reassemble on either side of the bag](https://www.youtube.com/watch?v=mcxkwhyXM8c&ab_channel=YummyPaper)? Or are you possibly trying to insert the entire coupler (both parts) inside the bag? Are you using the same brand - did they come together? If you use either the Wilton system or the Ateco system, any piping tip you buy will work with the same brand couplers; I use Ateco tips and you can get Ateco small, medium or large couplers, and it's easy to tell which tips go with which couplers. \n\nIf this doesn't help sort it out, is it possible you could post a photo of how it's not fitting properly?",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1jajm69": {
        "title": "Help with oven settings please",
        "body": "Hello,\n\nMy oven is currently broken and the landlord hasn’t fixed in months so the normal fan settings does work (the fan turns on but there’s no heat). I use the fan fan and grill setting for normal frozen food and have tried it for baking but it burns the top of my cookies.\n\nDo you have any recommendations? Would baking with foil on top work?\n",
        "author": "b1sirijq",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1jajm69/",
        "comments": {
            "mhms19r": {
                "author": "bq5lo",
                "body": "I have a conventional electric oven, so I don't totally understand what your oven is doing. It sounds like it's only cooking with a top element, like a broiler? ",
                "bot": false,
                "replies": {
                    "mhn0ot1": {
                        "author": "b1sirijq",
                        "body": "Yes! So it’s like a convention and broiler setting, I’m unsure how to bake with this setting",
                        "bot": false,
                        "replies": {
                            "mhn1vv3": {
                                "author": "bq5lo",
                                "body": "It's kind of like an upside-down grill at that point, so things that require a light toasting will work better than most baking projects will. \n\n\nHave you harassed the landlord every day about fixing it? Is there any way you could get a small counter top oven in the meantime? ",
                                "bot": false,
                                "replies": {
                                    "mhn2ayr": {
                                        "author": "b1sirijq",
                                        "body": "Nah I’ve had to make do with using foil and keeping an eye. We have a new house manager so I’ll ask them.",
                                        "bot": false,
                                        "replies": {}
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    },
    "1jaj9wo": {
        "title": "Probably ruined a pie?",
        "body": "I tried making an apple pie with a crumble topping (recipe here: https://sallysbakingaddiction.com/apple-crumble-pie/#tasty-recipes-73569)\n\nAnd somehow forgot to melt the 5T of butter and add it to the crumble. So it was literally just flour, spices, brown sugar, and nuts. And I dumped it onto the apples in the pie pan and didn't realize until after it finished baking how badly I messed up. Obviously because it was just dry as a bone it got all in the apple mix instead of just coating on top, so it's entirely mixed in and I cant just take it off.\n\nIs this remotely redeemable or did I make an inedible mess? ",
        "author": "4egl0xgq",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1jaj9wo/",
        "comments": {
            "mhm1x6r": {
                "author": "vkf83dy0",
                "body": "I’m going to need to investigate further…please send me a piece so I can make a fully informed decision.\n\nReal answer: it’s not ideal, but it probably won’t ruin the pie. Most people wouldn’t even notice. Serve it with ice cream and try to remember next time.",
                "bot": false,
                "replies": {}
            },
            "mhm22z7": {
                "author": "37kxlk2b",
                "body": "There was a post this week where a redditor shared that they put oopsie bakes like this as a folded in addition to yellow cake. I’d give they a try! \n\nYellow cake \nAdd in failed bakes.\nTwo 9 inch cakes \n\n1 c (227 g) salted butter, rt\n1 ¾ c (371 g) granulated sugar\n2 t vanilla\n3 large eggs, rt\n2 large egg yolks, rt\n2 ¼ c (255 g) cake flour or 210g APF, 45 g cornstarch \n1 ½ t baking powder\n¼ t baking soda\n½ t salt or 1 t if using uns butter\n½ c milk, 1% or above, rt\n½ c sour cream, light or regular, rt\n\nTo prep, whisk together the milk and sour cream together in a liquid measure and let come to room temperature\n\nPreheat the oven to 350 degrees F and make sure an oven rack is placed in the middle of the oven.\n\nIn a large bowl of an electric stand mixer or with a handheld electric mixer, whip the butter on medium speed for 1-2 minutes. Add the granulated sugar and beat for 4-5 minutes on medium speed. Mix in the vanilla.\n\nOne at a time, add the eggs and egg yolks, mixing just until combined in between additions. Scrape down the sides of the bowl as needed.\n\nCombine the cake flour, baking powder, baking soda and salt. Sift them together through a fine mesh strainer.\n\nAdd 1/3 of the dry ingredients to the batter and mix just until combined, scraping down the sides of the bowl as needed. Add 1/2 of the milk/sour cream mixture and mix. Add another 1/3 of the dry ingredients, mixing just until combined. Add the last 1/2 of the milk/sour cream mixture and beat until just combined. Add the final 1/3 of the dry ingredients and mix just until combined, scraping down the sides of the bowl if necessary. Give the batter one good, final stir with the rubber spatula.\n\nGrease the cake pans and line the bottoms with a parchment round. Grease the parchment and sides of the pan again very well. I use regular cooking spray but you can also use butter or cooking spray with flour. If your cake pans tend to cause sticking, consider also flouring the pans.\nDivide the batter evenly between the two pans. Drop each pan from about 3-inches onto the counter to minimize air bubbles while baking.\n\nBake for 25-28 minutes (high altitude: 28-30 minutes) until lightly golden around the edges and a toothpick inserted in the center comes out with moist crumbs. Resist the urge to open and close the oven to check on the cake – this can cause the center of the cake to fall and never recover. And as with all cakes, don’t overbake or the cake will be dry.\n\nLet the cakes rest in the pans for 5-10 minutes before gently turning them onto a cooling rack to cool completely.",
                "bot": false,
                "replies": {}
            }
        }
    },
    "1ja58mj": {
        "title": "Can a 4.5-Quart KitchenAid Handle/Knead a 600g of Flour?",
        "body": "I have a 4.5-quart KitchenAid, but I’m not sure if it can handle dough (for buns) with 600 grams of flour. Has anyone tried kneading a dough of this size in a 4.5-quart KitchenAid?\n\nI've already tried using 600g of flour in my KA mixer but this is only for a cookie dough. ",
        "author": "1cfyxtaywd",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1ja58mj/",
        "comments": {
            "mhixpgj": {
                "author": "d27bs",
                "body": "Unfortunately it probably won’t handle it. I used to have a tilt head KA that size and my bun recipe has that much flour as well. The mixer couldn’t quite handle it. If I tried, the dough would creep up/get wrapped around the top of the dough hook. I could kind of get it to work if I stopped it every few seconds to push the dough back into the bottom of the bowl, but usually I would just give up and knead it by hand.",
                "bot": false,
                "replies": {
                    "mhiy3vv": {
                        "author": "1cfyxtaywd",
                        "body": "Thanks!! I'll just probably make my dough in 2 batches to make it easy despite the longer time 😅",
                        "bot": false,
                        "replies": {}
                    }
                }
            },
            "mhit1fg": {
                "author": "55s9h8on",
                "body": "Id give it plenty of rest time.  Stop cool stop.  Which may not be practical \n\nMy Kitchenaid was terrible for dough.  \n\nMy Kenwood handled the dough much better.",
                "bot": false,
                "replies": {
                    "mhitgtk": {
                        "author": "1cfyxtaywd",
                        "body": "I'm kinda worried that it won't knead my dough properly and waste my ingredients haha that's why i'm kinda torn if i should just make my buns into 2 batches (1 batch requires 300g of flour) 😅",
                        "bot": false,
                        "replies": {
                            "mhix8q3": {
                                "author": "55s9h8on",
                                "body": "Can you do a few mins in the mixer and then do some by hand ? Sorry I’m not more helpful",
                                "bot": false,
                                "replies": {
                                    "mhiy0dm": {
                                        "author": "1cfyxtaywd",
                                        "body": "I do think kneading by hand is the best way! Thanks for the comment, i appreciate it!! 🙏",
                                        "bot": false,
                                        "replies": {}
                                    }
                                }
                            }
                        }
                    },
                    "mhkxdh8": {
                        "author": "ffd5d",
                        "body": "It's because home Kitchenaids aren't designed for bread, even though they include a dough hook. They just don't have enough power.\n\nKenwoods though. Man, mine works like a champ with dough.",
                        "bot": false,
                        "replies": {
                            "mhnial4": {
                                "author": "55s9h8on",
                                "body": "Yes my Kenwood was a workhorse. Even if it wasn’t as stylish as the kitchen aid.",
                                "bot": false,
                                "replies": {}
                            }
                        }
                    }
                }
            }
        }
    },
    "1ja15vb": {
        "title": "Cake decorators how do you transport two tier cakes?",
        "body": "I’m new to cake decorating, I just started my cake business and I’m wondering how people transport two/3 tier cakes? ",
        "author": "vlhpxlhz",
        "bot": false,
        "url": "https://www.reddit.com/r/askbaking/comments/1ja15vb/",
        "comments": {
            "mhiiniv": {
                "author": "6bdhtkaz",
                "body": "There are two schools of thought: \n\n- stack at your kitchen and transport\n\n- transport layers and stack at your destination.\n\nPersonally, after doing both….i find it’s easier to stack ahead of time and move a large, heavy cake. \n\nStacking at a venue is just fraught with uncontrollable factors and I’m always more stressed",
                "bot": false,
                "replies": {}
            },
            "mhi5g5n": {
                "author": "360x4ynw",
                "body": "CakeSafe.\nThey are expensive but worth every penny especially if you start delivering a lot of big cakes they are worth every penny. I now own 2 because I swear by them",
                "bot": false,
                "replies": {}
            },
            "mhidewr": {
                "author": "7ok5e",
                "body": "Transport the tiers separately, bring gear, get there early, and assemble on-site!",
                "bot": false,
                "replies": {}
            },
            "mhief5y": {
                "author": "ygruj",
                "body": "Generally you'll either transport the tiers before you stack them and do final assembly at the venue, or else you'll put a sturdy dowel through the middle of the cake, preferably bolted to the cake board so it can't wobble at all.",
                "bot": false,
                "replies": {}
            },
            "mhj5seg": {
                "author": "d9mq5jeu",
                "body": "I nearly always stacked fondant cakes on site if design allowed but buttercream stacked at home.    Lots of advice given already, an extra bit!   Put them in the boot/trunk of the car with the back of the cake facing direction of travel (so that if the worst happens and you severely brake only the back will be damaged hopefully), use non slip matting under the boxes and push the boxes right up to back seat so that they can't move anywhere.   Be particularly carefully over speed bumps and around corners and roundabouts.",
                "bot": false,
                "replies": {}
            },
            "mhi4i7g": {
                "author": "2jzcgcpq",
                "body": "We would just put them in large two tier boxes, cardboard should be fine as long as your cake boards have enough extra space on the sides. And dowel them as mentioned. And bring a touch up/emergency kit",
                "bot": false,
                "replies": {
                    "mhi538d": {
                        "author": "vlhpxlhz",
                        "body": "Thank you soo much. I will try this method. I’m very nervous as I just started doing big cakes.",
                        "bot": false,
                        "replies": {
                            "mhi5ij1": {
                                "author": "2jzcgcpq",
                                "body": "Just make sure to bring a piping bag full of whatever icing you might need to touch up, a couple basic tips, a couple small offset spatulas, maybe a contrasting color to pipe a flower or something to hide damage, that kind of stuff.\n\nAs for the boards just make sure you have a good inch or two around the perimeter to keep it off the side of the box\n\nEdit: also give yourself plenty of time, and make sure to double check whatever your setting it on is sturdy before you put it down. We had a table collapse once that wasn't popped up correctly!",
                                "bot": false,
                                "replies": {}
                            }
                        }
                    }
                }
            },
            "mhmrwgc": {
                "author": "f8bi363f",
                "body": "It totally depends on the design. Some cakes will be transported tiered, some will be tiered at the event.",
                "bot": false,
                "replies": {}
            },
            "mhn4c2k": {
                "author": "vlhpxlhz",
                "body": "Thank you everyone for replying to me. I’m soo thankful for this community. As a beginner this means a lot.",
                "bot": false,
                "replies": {}
            },
            "mhhwy6f": {
                "author": "2d29mavl",
                "body": "When I sold wedding cakes, if it was possible, I used to stake them (drive a large dowel through the center before decorating the top). Also, my husband built a wooden box for me to transport them. The box was open at the top and could accommodate a 15-inch base.",
                "bot": false,
                "replies": {
                    "mhhytfd": {
                        "author": "vlhpxlhz",
                        "body": "Thank you soo much. Do you by any chance have a pic of the box?",
                        "bot": false,
                        "replies": {
                            "mhhzoy9": {
                                "author": "2d29mavl",
                                "body": "Sorry, I closed my business years ago and my husband repurposed the plywood. The box was built out of thin plywood, was about 3 feet tall and designed so a 15-inch cake base fit in it, with just enough room for me to reach in",
                                "bot": false,
                                "replies": {
                                    "mhi4wc1": {
                                        "author": "vlhpxlhz",
                                        "body": "Thank you",
                                        "bot": false,
                                        "replies": {
                                            "mhi51v7": {
                                                "author": "2d29mavl",
                                                "body": "You're welcome. Good luck!",
                                                "bot": false,
                                                "replies": {}
                                            },
                                            "mhk9p8s": {
                                                "author": "53jjdo0z",
                                                "body": "You could maybe try a square plastic laundry hamper/ basket. \n\nTake a 15\" base with you to see if it fits in the bottom & you can reach in.",
                                                "bot": false,
                                                "replies": {}
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            },
            "mhi4c0p": {
                "author": "pyb68wz",
                "body": "I put dowels or straws in each tier except the top when frosting, transport unstacked, and assemble and finish decorating at the venue.",
                "bot": false,
                "replies": {
                    "mhi4ztz": {
                        "author": "vlhpxlhz",
                        "body": "Thank you, I’m excited but very nervous how this is going to go.",
                        "bot": false,
                        "replies": {
                            "mhi5tl7": {
                                "author": "pyb68wz",
                                "body": "That’s normal :) I personally would rather stress of decorating on site than that of driving with a stacked cake, but to each their own! Either way, be sure to bring an extra piping bag of your frosting and tools like offset spatula, scraper, and kitchen tweezers (even if you think you won’t need them). I’ve had cakes develop a crack in the frosting in transit, and you always want to be able to fix any issues that might occur.",
                                "bot": false,
                                "replies": {}
                            }
                        }
                    }
                }
            }
        }
    }
}